ljufa/esp32_camera/firmware/sdkconfig.defaults.esp32s3
# Freenove ESP32-S3-WROOM (16 MB flash, 8 MB OPI PSRAM)
# Fitted with an OV2640 — the OV5640 overheats on this board.
CONFIG_IDF_TARGET="esp32s3"
CONFIG_BOARD_TYPE="esp32s3-freenove"

# Higher capture quality than the base esp32cam: SXGA 1280x1024 (frame_size
# 12). OV2640 sensor output caps at 15 fps above SVGA, and frames are ~2x
# the bytes — drop to 10 (XGA) if fps matters more than detail.
CONFIG_FRAME_SIZE=12
CONFIG_JPEG_QUALITY=10

# 16 MB flash (S3 flash clock already defaults to 80 MHz)
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# 8 MB OPI PSRAM @ 80 MHz
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_BOOT_INIT=y

CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions_esp32s3.csv"

# Camera pins
CONFIG_CAM_PIN_PWDN=-1
CONFIG_CAM_PIN_RESET=-1
CONFIG_CAM_PIN_XCLK=15
CONFIG_CAM_PIN_SIOD=4
CONFIG_CAM_PIN_SIOC=5
CONFIG_CAM_PIN_D7=16
CONFIG_CAM_PIN_D6=17
CONFIG_CAM_PIN_D5=18
CONFIG_CAM_PIN_D4=12
CONFIG_CAM_PIN_D3=10
CONFIG_CAM_PIN_D2=8
CONFIG_CAM_PIN_D1=9
CONFIG_CAM_PIN_D0=11
CONFIG_CAM_PIN_VSYNC=6
CONFIG_CAM_PIN_HREF=7
CONFIG_CAM_PIN_PCLK=13
